---
type: Options
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# Options

`Autodesk.Revit.DB.Options` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Options | — | `` |
| Constructor | Options | — | `public Options ()` |
| Property | ComputeReferences | — | `public bool ComputeReferences { get ; set ; }` |
| Property | DetailLevel | — | `public ViewDetailLevel DetailLevel { get ; set ; }` |
| Property | IncludeNonVisibleObjects | — | `public bool IncludeNonVisibleObjects { get ; set ; }` |
| Property | View | — | `public View View { get ; set ; }` |